# WEEK ONE
### Etana Diasa <br> 11/08/2019
# Introduction
#### For this introductor week, we will perform acquiring data from GitHub and manipulate--or I would like to call it handling rather than manipulating--in order to have a specific information at hand. We will also use another dataset to perform similar action on a different dataset. 

# Methods
#### To start working, we would need to import the Pandas library which we will use to handle and analyze data.

In [1]:
import pandas as pd

## PART 1 GAPMINDER DATA
### Data Importing
#### From here, we will download the dataset from github called gapminder.tsv. It is a tab seperated dataset.

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/jennybc/gapminder/master/inst/extdata/gapminder.tsv", delimiter="\t")

In [3]:
df.head() # This reads the first five (default 5 unless specified) observations of the dataset.

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

### Exploring the Dataset

In [4]:
type(df) # This line of code returns the type of dataset.

pandas.core.frame.DataFrame

In [5]:
df.shape # Similar to the [str()] code in R, this returns the number of observations and variables.

(1704, 6)

In [6]:
df.columns # This line of code returns the name of the variables in the dataset

Index([u'country', u'continent', u'year', u'lifeExp', u'pop', u'gdpPercap'], dtype='object')

In [7]:
df.dtypes # This line of code returns a list of all the variables along with their datatype.

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [8]:
df.info() # This line helps us explore more info about the dataset including null observations and so.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
country      1704 non-null object
continent    1704 non-null object
year         1704 non-null int64
lifeExp      1704 non-null float64
pop          1704 non-null int64
gdpPercap    1704 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 79.9+ KB

### Selecting Rows and Columns

In [9]:
country_df = df['country'] # This line creates a dataset 'country_df' by selecting 'country' from 'df'.
country_df.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [10]:
subset = df[['country', 'continent', 'year']] #Similarly, this line selects multiple columns. 
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [11]:
sub_columns = ['country', 'continent', 'year'] # Here, 'sub_columns' is defined and later called to perform the same thing. 
sub_df = df[sub_columns]
sub_df.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

### Rows
#### The loc[] command reads observation of a specified location based on the index number. However, iloc[] takes the actual (true) row regardless of indexing.

In [12]:
df.loc[0] # For example here, the return value shows the first line of observation in the dataset indexed as 0.

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [13]:
df.iloc[0] # Here, it appears that both iloc and loc are returning the same thing.

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

#### Below, we will make the 'year' column our index and see how the iloc and loc functions work distinctively.

In [14]:
year_df = df.copy()

In [15]:
year_df.set_index('year', inplace=True)

In [16]:
year_df.head()

          country continent  lifeExp       pop   gdpPercap
year
1952  Afghanistan      Asia   28.801   8425333  779.445314
1957  Afghanistan      Asia   30.332   9240934  820.853030
1962  Afghanistan      Asia   31.997  10267083  853.100710
1967  Afghanistan      Asia   34.020  11537966  836.197138
1972  Afghanistan      Asia   36.088  13079460  739.981106

In [17]:
year_df.loc[1952].head() # Now this returns the 1952 as the assigned index.

          country continent  lifeExp       pop    gdpPercap
year
1952  Afghanistan      Asia   28.801   8425333   779.445314
1952      Albania    Europe   55.230   1282697  1601.056136
1952      Algeria    Africa   43.077   9279525  2449.008185
1952       Angola    Africa   30.015   4232095  3520.610273
1952    Argentina  Americas   62.485  17876956  5911.315053

In [18]:
year_df.iloc[0] # However, the true location of the observation is still 0 despite the defined index.

country      Afghanistan
continent           Asia
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 1952, dtype: object

### Multiple Rows

In [19]:
year_df.iloc[[0,10,100]] # This line returns multiple rows of the specified locations.

          country continent  lifeExp       pop   gdpPercap
year
1952  Afghanistan      Asia   28.801   8425333  779.445314
2002  Afghanistan      Asia   42.129  25268405  726.734055
1972   Bangladesh      Asia   45.252  70759295  630.233627

In [20]:
index_range = list(range(0,10)) # We can also do a range of locations of rows to select and return. 
year_df.iloc[index_range]

          country continent  lifeExp       pop   gdpPercap
year
1952  Afghanistan      Asia   28.801   8425333  779.445314
1957  Afghanistan      Asia   30.332   9240934  820.853030
1962  Afghanistan      Asia   31.997  10267083  853.100710
1967  Afghanistan      Asia   34.020  11537966  836.197138
1972  Afghanistan      Asia   36.088  13079460  739.981106
1977  Afghanistan      Asia   38.438  14880372  786.113360
1982  Afghanistan      Asia   39.854  12881816  978.011439
1987  Afghanistan      Asia   40.822  13867957  852.395945
1992  Afghanistan      Asia   41.674  16317921  649.341395
1997  Afghanistan      Asia   41.763  22227415  635.341351

In [21]:
index_range # Here, we can see what the list defined as 'index_range' is.

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [22]:
index_range[0:5] # This returns the first 5 numbers in the list 'index_range'

[0, 1, 2, 3, 4]

In [23]:
index_range[:] # This line returns everthing from the beginning to the end.

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [24]:
df.loc[0:4, :] # Returns all five observations from index locations 0 to 5.

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [25]:
# Displays all rows of columns year and pop. But 'head()' shows the first five rows to display. 
df.loc[:, ['year', 'pop']].head()

   year       pop
0  1952   8425333
1  1957   9240934
2  1962  10267083
3  1967  11537966
4  1972  13079460

In [26]:
# We can also specify columns in loc and iloc functions. 
# Here this code returns every row of the first three columns.
df.iloc[:, :3].head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

### Filtering and Aggragation
#### The 'groupby()' functions groups observations per specified variables. Below is an example of grouping observations by year to show the mean lifeexpectancy (lifeExp).

In [27]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [28]:
# Furthermore, we can group this dataset in 'year' and 'continent'.
# It then populates the mean 'lifeExp' and 'gdpPercap'. 
df.groupby(['year', 'continent']) \
[['lifeExp', 'gdpPercap']]. \
mean().head(n=20)

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650
1957 Africa     41.266346   1385.236062
     Americas   55.960280   4616.043733
     Asia       49.318544   5787.732940
     Europe     66.703067   6963.012816
     Oceania    70.295000  11598.522455
1962 Africa     43.319442   1598.078825
     Americas   58.398760   4901.541870
     Asia       51.563223   5729.369625
     Europe     68.539233   8365.486814
     Oceania    71.085000  12696.452430
1967 Africa     45.334538   2050.363801
     Americas   60.410920   5668.253496
     Asia       54.663640   5971.173374
     Europe     69.737600  10143.823757
     Oceania    71.310000  14495.021790

In [29]:
# We can faltten out the result by indexing it as below. 
df.groupby(['year', 'continent']) \
[['lifeExp', 'gdpPercap']]. \
mean(). \
reset_index().\
head()

   year continent    lifeExp     gdpPercap
0  1952    Africa  39.135500   1252.572466
1  1952  Americas  53.279840   4079.062552
2  1952      Asia  46.314394   5195.484004
3  1952    Europe  64.408500   5661.057435
4  1952   Oceania  69.255000  10298.085650

### Counting Unique Values
#### Below, the 'nunique()' function counts how many unique observations are there in the dataset grouped by 'continent' and 'country'.

In [30]:
df.groupby('continent')['country'].nunique()

continent
Africa      52
Americas    25
Asia        33
Europe      30
Oceania      2
Name: country, dtype: int64

## PART 2 UCI CAR DATA
### Acquiring and Exploring Data

In [31]:
MyCar = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/car/car.data', delimiter=',', header=None)
MyCar.head()

       0      1  2  3      4     5      6
0  vhigh  vhigh  2  2  small   low  unacc
1  vhigh  vhigh  2  2  small   med  unacc
2  vhigh  vhigh  2  2  small  high  unacc
3  vhigh  vhigh  2  2    med   low  unacc
4  vhigh  vhigh  2  2    med   med  unacc

In [32]:
type(MyCar) # Our dataset is a dataframe.

pandas.core.frame.DataFrame

In [33]:
MyCar.columns # It appears that there are 7 columns and they are generically numbered. Lets change the names.

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

In [34]:
MyCar.columns = ['buying','maint','doors','persons','lug_boot','safety','unacc'] # Columns renamed.

In [35]:
MyCar.dtypes

buying      object
maint       object
doors       object
persons     object
lug_boot    object
safety      object
unacc       object
dtype: object

In [36]:
MyCar.shape # Here, we have 1728 rows and 7 columns; in other words 1728 observations across 7 variables.

(1728, 7)

In [37]:
MyCar.info() # The datadescription from the UCI website indicates that there is no null-value. Surely that's the case.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1728 entries, 0 to 1727
Data columns (total 7 columns):
buying      1728 non-null object
maint       1728 non-null object
doors       1728 non-null object
persons     1728 non-null object
lug_boot    1728 non-null object
safety      1728 non-null object
unacc       1728 non-null object
dtypes: object(7)
memory usage: 94.6+ KB

### Selecting Rows and Columns

In [38]:
MyCar_doors = MyCar[['doors']]
MyCar_doors.head()

  doors
0     2
1     2
2     2
3     2
4     2

In [39]:
MyCar_doors_persons = MyCar[['doors','persons']]
MyCar_doors_persons.head()

  doors persons
0     2       2
1     2       2
2     2       2
3     2       2
4     2       2

### Rows

In [40]:
MyCar.loc[25] # This is the 25th observation across all the variables.

buying      vhigh
maint       vhigh
doors           2
persons      more
lug_boot      big
safety        med
unacc       unacc
Name: 25, dtype: object

In [41]:
# Now, I will duplicate a working dataset to make 'doors' an index to the dataset. 
MyCar_copy = MyCar.copy()
MyCar_copy.set_index('doors', inplace=True)
MyCar_copy.head()

      buying  maint persons lug_boot safety  unacc
doors
2      vhigh  vhigh       2    small    low  unacc
2      vhigh  vhigh       2    small    med  unacc
2      vhigh  vhigh       2    small   high  unacc
2      vhigh  vhigh       2      med    low  unacc
2      vhigh  vhigh       2      med    med  unacc

In [42]:
MyCar_copy.loc['5more'].head() # Big lesson here. 'loc[]' does not have to be an integer. ;)

      buying  maint persons lug_boot safety  unacc
doors
5more  vhigh  vhigh       2    small    low  unacc
5more  vhigh  vhigh       2    small    med  unacc
5more  vhigh  vhigh       2    small   high  unacc
5more  vhigh  vhigh       2      med    low  unacc
5more  vhigh  vhigh       2      med    med  unacc

In [43]:
MyCar_copy.iloc[[1234]] # Returns only one observation with the specified location.

      buying maint persons lug_boot safety unacc
doors
3        med   low    more    small    med   acc

### Multiple Rows

In [44]:
MyCar_copy.iloc[[0,10,1001]]

      buying  maint persons lug_boot safety  unacc
doors
2      vhigh  vhigh       2    small    low  unacc
2      vhigh  vhigh       4    small    med  unacc
3        med   high       2    small   high  unacc

In [45]:
index_range = list(range(0,10))
MyCar_copy.iloc[index_range]

      buying  maint persons lug_boot safety  unacc
doors
2      vhigh  vhigh       2    small    low  unacc
2      vhigh  vhigh       2    small    med  unacc
2      vhigh  vhigh       2    small   high  unacc
2      vhigh  vhigh       2      med    low  unacc
2      vhigh  vhigh       2      med    med  unacc
2      vhigh  vhigh       2      med   high  unacc
2      vhigh  vhigh       2      big    low  unacc
2      vhigh  vhigh       2      big    med  unacc
2      vhigh  vhigh       2      big   high  unacc
2      vhigh  vhigh       4    small    low  unacc

### Column Slicing

In [46]:
MyCar.loc[2, :] # The fist 5 rows across all the columns.

buying      vhigh
maint       vhigh
doors           2
persons         2
lug_boot    small
safety       high
unacc       unacc
Name: 2, dtype: object

In [47]:
# Below, we select two columns and just two indexing values.
# If our index is not int, we can still do slicing like this. 
# Here we can see the tail end of the populated data.
MyCar_copy.loc[['3','4'],['buying','persons']].tail()

      buying persons
doors
4        low    more
4        low    more
4        low    more
4        low    more
4        low    more

### Filtering and Aggragation

In [48]:
MyCar.groupby(['buying']).head() 
# Because we're dealing with non-numeric columns arithmetic functions such as mean and median do not apply here.

     buying  maint doors persons lug_boot safety  unacc
0     vhigh  vhigh     2       2    small    low  unacc
1     vhigh  vhigh     2       2    small    med  unacc
2     vhigh  vhigh     2       2    small   high  unacc
3     vhigh  vhigh     2       2      med    low  unacc
4     vhigh  vhigh     2       2      med    med  unacc
432    high  vhigh     2       2    small    low  unacc
433    high  vhigh     2       2    small    med  unacc
434    high  vhigh     2       2    small   high  unacc
435    high  vhigh     2       2      med    low  unacc
436    high  vhigh     2       2      med    med  unacc
864     med  vhigh     2       2    small    low  unacc
865     med  vhigh     2       2    small    med  unacc
866     med  vhigh     2       2    small   high  unacc
867     med  vhigh     2       2      med    low  unacc
868     med  vhigh     2       2      med    med  unacc
1296    low  vhigh     2       2    small    low  unacc
1297    low  vhigh     2       2    small    med  unacc
1298    low  vhigh     2       2    small   high  unacc
1299    low  vhigh     2       2      med    low  unacc
1300    low  vhigh     2       2      med    med  unacc

### Count Unique

In [49]:
MyCar.groupby('maint')['doors'].nunique()

maint
high     4
low      4
med      4
vhigh    4
Name: doors, dtype: int64

# Conclusion
#### Using these and several other methods, one can handle datasets and prepare data appropriate for a specific projet. Python offers several different ways to work through columns and rows as we have exercised using them in this project.